---
kind: other
id: Methods.T:Autodesk.Revit.DB.LogicalAndFilter
source: html/94b6716d-de5e-8a1a-c084-9a6de4a07905.htm
---
# LogicalAndFilter Methods

Returns an array of copies of the filters that are logically combined by this ElementLogicalFilter.